{
  "title": "Chiara Workout Book",
  "bodyweight": 70,
  "barbell": 7.5,
  "plans": [
    {
      "name": "Day A",
      "dayplan": [
        ["Barbell lunge"],
        ["Leg curl"],
        ["Regular leg press"],
        ["Incline leg press"],
        ["Barbell squat"],
        ["TRX jump"]
      ]
    }
  ],
  "workouts": [
    {
      "name": "Barbell lunge",
      "minreps": 8,
      "maxreps": 10,
      "minsets": 3,
      "maxsets": 4,
      "suggestedprogression": [10, 10, 10, "10*"],
      "picture": "./images/barbell-lunge.png",
      "hasweight": "yes",
      "weightmin": 20,
      "weightmax": 32,
      "notes": [
        "Exhale as you take a large step (lunge) forward with one leg, landing on your heel first and then lowering your forefoot.",
        "At the same time, keeping your torso upright, lower your body until the knee of your supporting leg almost touches the floor.",
        "Inhale as you drive back up with your heel and step back into the starting position."
      ]
    },
    {
      "name": "Barbell squat",
      "minreps": 8,
      "maxreps": 10,
      "minsets": 3,
      "maxsets": 4,
      "suggestedprogression": [10, 10, 10, "10*"],
      "picture": "./images/barbell-squat.png",
      "hasweight": "yes",
      "weightmin": 30,
      "weightmax": 32,
      "notes": ["nessuna nota"]
    },
    {
      "name": "Leg curl",
      "minreps": 8,
      "maxreps": 10,
      "minsets": 3,
      "maxsets": 4,
      "suggestedprogression": [8, 8, 8, "8*"],
      "picture": "./images/leg-curl.png",
      "hasweight": "yes",
      "weightmin": 17.5,
      "weightmax": 32,
      "notes": [
        "Keep the movement slow and controlled.  Try to resist the lowering of the lever; don’t just let it drop.  Don’t allow your hips to rise off the bench.",
        "Keep your ankles flexed so that your toes point toward your shins. This allows your gastrocnemii to offer better assistance.  Adjusting the orientation of your feet during the lying leg curl emphasizes different hamstring muscles. Keep your feet straight to emphasize all hamstrings. Turn your feet inward to emphasize your inner hamstrings (semitendinosus and semimembranosus). Turn your feet outward to emphasize your outer hamstring (biceps femoris)."
      ]
    },
    {
      "name": "Incline leg press",
      "minreps": 8,
      "maxreps": 10,
      "minsets": 3,
      "maxsets": 4,
      "suggestedprogression": [8, 8, 8, "8*"],
      "picture": "./images/leg-press.png",
      "hasweight": "yes",
      "weightmin": 40,
      "weightmax": 60,
      "notes": [
        "Keep your feet flat on the platform, and your knees and toes pointing in the same direction (slightly outward).",
        "Do not lock your knees out when you press the platform up.",
        " The incline leg press is a very versatile exercise. Altering the position of your feet on the platform will emphasize different muscle groups. The higher your feet on the platform, the more you will emphasize your gluteus maximus and hamstrings. The lower your feet on the platform, the more you will emphasize your quadriceps. The wider your feet on the platform, the more you will emphasize your adductor magnus and inner quadriceps. The closer-together your feet on the platform, the more you will emphasize your outer quadriceps."
      ]
    },
    {
      "name": "Regular leg press",
      "minreps": 8,
      "maxreps": 10,
      "minsets": 3,
      "maxsets": 4,
      "suggestedprogression": [8, 8, 8, "8*"],
      "picture": "./images/leg-press.png",
      "hasweight": "yes",
      "weightmin": 30,
      "weightmax": 60,
      "notes": ["nessuna nota"]
    }
  ]
}
